{
  "festerfonts": [
    {
      "name": "",
      "class": "",
      "saturation": "",
      "biome": "",
      "configuration": "",
      "layers": {
        "outskirts": {
          "blightbeasts": ["", "", ""],
          "description": ["", "", ""]
        },
        "body": {
          "blightbeasts": ["", "", ""],
          "description": ["", "", ""]
        },
        "core": {
          "blightbeasts": ["", "", ""],
          "description": ["", "", ""]
        }
      },
      "description": ["", "", ""],
      "region": "",
      "introduced": 0
    }
  ],
  "information": {
    "description": [
      "Festerfonts are locations around the planet that are under the influence of the phenomena collectively referred to as 'The Blight'. The Blightbane Guild has attempted to study them, but little progress has been made. They remain a mysterious, growing collection of territories, each one defended by fearsome creatures known as blightbeasts. These creatures are creatures seemingly for the sole purpose of defending the occupied land, warding off invaders who would attempt to cleanse the festerfont's domain.",
      "Young festerfonts will have starkly different biomes from untainted land. As a festerfont accumulates saturation and age, it learns to blend in by finding living creatures to occupy its land. It is a learned disguise. A young festerfont may disturb travellers with its presence, but an ancient festerfont is a thing to fear. Travellers may not know it, but they have no chance of escaping alive once they cross the threshold. ",
      ""
    ],
    "layersDescription": [
      "Festerfonts are each composed of three layers. The outermost layer is referred to as the 'Outskirts', the middle layer is the 'Body', and the innermost layer is the 'Core'. Danger increases drastically when one passes the typically-invisible boundary from layer to layer. The Blightbane Guild places totems known as 'Seekerstones' to mark the location of these layers, though they must move them as the boundary shifts with the ebb and flow of blight accumulation and degradation.",
      "",
      ""
    ],
    "locusDescription": [
      "Also referred to as the 'Sourcefonts', these are festerfont structures are located somewhere within the Core layer of the festerfont. Accessing one is not easy, but destroying it will stop the spawning of blightbeasts, rapidly removing the festerfont entirely. Most Blight Loci cannot be destroyed without extensive digging or exploratory work, some do not appear to be vulnerable to destruction at all.",
      "",
      ""
    ],
    "knownFesterfontsDescription": ["", "", ""],
    "filterDescription": [""],
    "class": {
      "description": ["", "", ""],
      "classifications": [
        {
          "name": "Clarion",
          "description": [
            "The safest and most common Base Class of Festerfont. However, it is still a Festerfont. The Blight is an inherently dangerous phenomenon. Clarion cannot contain natural hazards that can heavily injure or outright kill a Seeker. Clarion may contain confusing tunnel systems, but they are greatly limited in number and inter-connectivity.",
            "",
            ""
          ],
          "configurations": ["", "", ""],
          "biomes": ["", "", ""],
          "blightsources": ["", "", ""]
        },
        {
          "name": "Umbra",
          "description": [
            "This is where festerfonts start to being much more dangerous, adding environmental hazards on top of more difficult blightbeasts. Only veteran seekers can take it easy here. Umbra may contain precarious ledges, moderately extreme temperatures, and pockets of unbreathable or otherwise dangerous gases.",
            "",
            ""
          ],
          "configurations": ["", "", ""],
          "biomes": ["", "", ""],
          "blightsources": ["", "", ""]
        },
        {
          "name": "Nihil",
          "description": [
            "These Festerfonts are off limits to most seekers. Most of the Festerfonts themselves, and a large buffer zone around each, are quarantined. Nihil often contain incredibly difficult terrain that can outright kill a Seeker who isn’t trained and constantly vigilant.",
            "",
            ""
          ],
          "configurations": ["", "", ""],
          "biomes": ["", "", ""],
          "blightsources": ["", "", ""]
        }
      ]
    },
    "configuration": {
      "description": [
        "The Festerfont configuration determines what kinds of creatures spawn, though geographical location also plays a key role. Additionally, differing configurations can greatly impact a festerfont's response to threats and also it's development.",
        "",
        ""
      ],
      "configurations": [
        {
          "name": "Generic",
          "description": [
            "Most Festerfonts are of the 'Generic' configuration . They don’t bear any special traits, only serving to maintain the influence of the Blight at a location. This configuration is also the most versatile with respect to spawning blightbeasts and blightsources.",
            "",
            ""
          ],
          "introduced": 0
        },
        {
          "name": "Command",
          "description": [
            "'Command' Festerfonts organize the Blight infestation and direct energy between Festerfont Blight Loci by unknown means. This is dangerous because it can provide explosive boosts to the threat level of the region, augmenting the abilities of existing festerfonts and focusing their defenses.",
            "These are more heavily guarded, and by more intelligent blightbeasts at that. Some of them even resemble sapient organic species.",
            "Command configurations can only exist when the surrounding Blight concentration is high enough. They will begin to fail if this level drops, but this process is slow, and their enhanced defensive measures more than makeup for it.",
            "The Blightsources that are found within these festerfonts are the rarest and some of the most valuable kinds. Scientists have yet to discover possible applications for many, but they are believed to be very valuable merely because they only show up in advanced Festerfonts.",
            "Only one Command configuration festerfont can be active in a region or similar limited radius."
          ],
          "introduced": 0
        },
        {
          "name": "Waypoint",
          "description": [
            "These festerfonts are responsible for supporting the spread of the Blight across the planet. They are generally small in size, concealed deep underground.The blightbeasts that accompany them are defense-oriented, resilient, but not particularly aggressive.",
            "Waypoint festerfonts are specialized in the transfer of Blight energy, even more so than a Command festerfont can.",
            ""
          ],
          "introduced": 0
        },
        {
          "name": "Infection",
          "description": [
            "These are dangerous festerfonts that blend in with the environment. Those who linger too long under their influence will begin to fall ill to an infection of Blight origin. For the most part, it can be treated, but late stages have the host transforming into something like a blightbeast themselves, threatening all who encounter them. They are difficult to purge because they blend so well, not because the Blight Locus is hard to destroy once found.",
            "Blightbeasts that spawn in Infection Festerfonts are typically small. They usually bear some kind of method of transferring a Blight contagion to a Seeker or another unfortunate person. This includes insects of various sizes and plants.",
            ""
          ],
          "introduced": 0
        },
        {
          "name": "Invasion",
          "description": [
            "Invasion festerfonts will lie dormant, gathering strength. During this time, they will not spawn any Blightbeasts. Some blightsources begin to appear, but only when the festerfont is about to subject the area to an explosive burst of activity.",
            "They are easy to purge if they can be noticed before going active. Once they become active, they are very difficult to handle unless the location is well defended and prepared.",
            "Once an Invasion festerfont goes active, it will begin spawning blightbeasts at an incredible rate, seeking to overwhelm the area, until it transitions to a Generic configuration when it has exhausted its stockpiled energy."
          ],
          "introduced": 0
        },
        {
          "name": "Failsafe",
          "description": [
            "At first, believed to be an unintended development of a festerfont, a Failsafe festerfont is a peculiar thing. Not much is understood, but they appear to be a natural reaction of the Blight phenomena as it attempts to balance its spread.",
            "This festerfont variant can appear in two primary ways. One is the result of a Command Festerfont 'reclaiming' the resources of a nearby festerfont. It is unknown how the resources are transferred back to the Command festerfont, but they are indeed transported. Second, a Failsafe can occur naturally, causing a festerfont to begin bleeding energy, by creating many blightbeasts and blightsources. This latter condition makes for a very lucrative harvest location for foolish and daring Seekers who succumb to their own greed.",
            ""
          ],
          "introduced": 0
        }
      ]
    },
    "saturation": {
      "description": [
        "Over time, a Festerfont will gradually grow more saturated with energy. An unknown source fuels this growth, but the Guild Intelligence Division has been working on determining whether it is possible to interrupt this process, or whether it is perhaps possible to tap into it themselves so that the sentient organisms on the planet can obtain an easily renewable source of energy to fuel civilizations in an age where booming populations and advanced technologies have caused energy demands to skyrocket.",
        "This energy is expended to spawn defenders in the form of blightbeasts. Killing the blightbeasts rapidly enough is a way of slowly depleting the festerfont of energy, but it will always replenish until the Blight Locus is destroyed.",
        "Higher saturation thresholds give rise to more dangerous blightbeasts, but a festerfont will not normally change configurations. Only the Invasion and Failsafe festerfont configurations are involved in configuration transition.",
        "The more saturated a festerfont becomes, the larger an area it encompasses. To account for this, the Guild will add a buffer in the mapping of festerfonts. Periodic tests are run on festerfonts to observe whether they have grown or shrunk in size. A rank is also assigned to a festerfont to indicate the general saturation level. This rank is only tied to the estimated energy saturation of the festerfont, and no other factors. This grows gradually, but is expended to spawn Blightbeasts. It will also fluctuate based on Command Configuration’s manipulations."
      ],
      "saturations": [
        {
          "name": "Placid",
          "description": [
            "A young Festerfont, or one recently deprived of power. Additionally, these are Festerfonts actively suppressed by the Guild.",
            "",
            ""
          ]
        },
        {
          "name": "Rippling",
          "description": [
            "A Festerfont that is brimming with energy, capable of activating advanced features specific to its configuration.",
            "",
            ""
          ]
        },
        {
          "name": "Violent",
          "description": [
            "These Festerfonts are extremely dangerous. They make entire swaths of land impassable by all but the most hardened of veterans.",
            "",
            ""
          ]
        }
      ]
    },
    "biome": {
      "description": [
        "Festerfonts differ depending on the 'biome' in which they are spawned. Different biomes give rise to different Festerfont Configurations, blightbeasts, and blightsources, with some specimens appearing more or less frequently, or not at all.",
        "",
        ""
      ],
      "biomes": [
        {
          "name": "Forest",
          "blightsources": [
            "Blightstones",
            "Blightichors",
            "Blightfumes",
            "Blightflora+++",
            "Blightfungi+++",
            "Blightanomalies"
          ],
          "configurations": [
            "Generic",
            "Command",
            "Waypoint",
            "Infection+",
            "Invasion",
            "Failsafe"
          ],
          "description": [
            "Tropical, deciduous, and boreal forests. Give rise to an incredible variety of festerfonts. Perhaps this is because the trees are better able to hide the Blight while it grows, or perhaps there is some interaction going on between the land and the ecosystem the Blight is supplanting.",
            "One danger more present in forest festerfonts are the Infection configurations. Veteran seekers know to avoid these locations unless the rewards outweigh the risks. Even then, only reckless fools advance.",
            ""
          ]
        },
        {
          "name": "Grassland",
          "blightsources": [
            "Blightstones-",
            "Blightichors",
            "Blightfumes-",
            "Blightflora+",
            "Blightfungi+",
            "Blightanomalies"
          ],
          "configurations": [
            "Generic",
            "Command",
            "Waypoint",
            "Infection",
            "Invasion+",
            "Failsafe"
          ],
          "description": [
            "Savanna and temperate grasslands afford plentiful space to reform the landscape to the will of the festerfont. Grassland festerfonts will sometimes become sprawling labyrinths, inexplicably sprouting up from Blighted plants and, rarely horrific fleshy matter. Here in these mazes, seekers must be wary of growing lost in twisting passages, to become feed for the blightbeasts stalking them. Some festerfont labyrinths will also change, ensnaring wandering seekers before they even know their exit has been cut off.",
            "The Invasion configuration is more common in grasslands than in other biomes. A specific variant of grassland festerfont lures prey by embedding blightbeasts underground, to jump out and swarm trespassers and annihilate them in one fell swoop.",
            ""
          ]
        },
        {
          "name": "Desert",
          "blightsources": [
            "Blightstones+++",
            "Blightichors",
            "Blightfumes+",
            "Blightflora--",
            "Blightfungi--",
            "Blightanomalies"
          ],
          "configurations": [
            "Generic",
            "Command",
            "Waypoint",
            "Infection",
            "Invasion",
            "Failsafe"
          ],
          "description": [
            "Hot and dry, semiarid, coastal, and cold deserts are all places a festerfont can spawn, proving that no matter where you are on the planet, you can't let your guard down. These locations are often inhospitable enough without the added lethality of the malevolent Blight. These festerfonts usually make use of the environment to kill efficiently. If the desert biome in question is necessary enough to the nation in charge of it, seekers will often purge these festerfonts as soon as they are able to.",
            "Desert festerfonts are deprived of many blightsources abundantly found in forests, tundra, and grasslands, for example, but a healthy supply Blightstones could make the area valuable as a harvesting spot. If that is the case, some Seeker Branches will decide to preserve the festerfont for a time, diverting civilian traffic through a waystation, allowing them to resupply there in exchange for a longer journey than was previously allowable.",
            ""
          ]
        },
        {
          "name": "Tundra",
          "blightsources": [
            "Blightstones+",
            "Blightichors+",
            "Blightfumes",
            "Blightflora+",
            "Blightfungi+",
            "Blightanomalies"
          ],
          "configurations": [
            "Generic",
            "Command",
            "Waypoint",
            "Infection",
            "Invasion",
            "Failsafe"
          ],
          "description": [
            "Arctic and alpine tundra environments, like deserts, are not places you want to have to content with the Blight. Festerfonts spawning here add another layer of danger. Others include the cold, ice, and potentially fatal mountain climbs. Sometimes, these festerfonts will burrow deep into a mountain's core, nestling their own Blight Locus within that inaccessible rock. Such specimens are less deadly, but significantly harder to root out during a purge.",
            "Blightbeasts found in these environments are often hulking apes, burrowing mammals and insects, and scavenging avians. Seekers must learn not to rely on agility, learn to fight on an incline, and also beware of falling snow, ice, and rock. If they are skilled, they can use the environment to level the playing field. Otherwise, their bodies might never be found.",
            ""
          ]
        },
        {
          "name": "Freshwater",
          "blightsources": [
            "Blightstones",
            "Blightichors++",
            "Blightfumes+",
            "Blightflora+",
            "Blightfungi+",
            "Blightanomalies"
          ],
          "configurations": [
            "Generic",
            "Command",
            "Waypoint",
            "Infection+",
            "Invasion",
            "Failsafe"
          ],
          "description": ["", "", ""]
        },
        {
          "name": "Marine",
          "blightsources": [
            "Blightstones++",
            "Blightichors--",
            "Blightfumes--",
            "Blightflora++",
            "Blightfungi++",
            "Blightanomalies"
          ],
          "configurations": [
            "Generic",
            "Command+",
            "Waypoint",
            "Infection",
            "Invasion",
            "Failsafe"
          ],
          "description": ["", "", ""]
        }
      ]
    }
  }
}
